{
    "Strawberry Drip Cake": "A light celebration sponge topped with silky buttercream and a glossy strawberry drip. Perfect for birthdays, thank-yous, or any day that needs something sweet.",
    "Strawberry Shortcake": "Classic strawberry and cream vibes in an elegant layer cake. A crowd-pleaser for family gatherings and summer parties.",
    "Star Cake": "Fun, bright, and photo-ready—this star-topped cake brings instant party energy to birthdays and school celebrations.",
    "Winnie The Pooh Cake": "A charming, character-inspired centrepiece for little fans. Sweet, soft sponge and playful decoration for a magical day.",
    "Unicorn Cake": "Whimsical colours and a smooth finish make this an unforgettable cake for birthdays, communions, and fairy-tale parties.",
    "Deluxe Christmas Cake": "A festive showstopper with a polished finish and seasonal flair. Ideal for December gatherings and office parties.",
    "Dinosaur Cake": "Bold, fun decoration for the dino-obsessed! A great pick for themed birthdays and family celebrations.",
    "Flower Drip Cake": "Buttercream florals meet a modern drip for an elegant, Instagram-ready finish—perfect for milestones and anniversaries.",
    "Jungle Cake": "Tropical colours and playful details bring adventure to your party table. A hit with kids and explorers at heart.",
    "Christmas Log Cake": "A cosy seasonal classic with a neatly rolled look and winter styling. Ideal for dessert tables and gift-giving.",
    "Girl Birthday Cake": "A polished, party-ready centrepiece in soft tones. Designed to look great in photos and taste even better.",
    "Cherry Drip Cake": "A vibrant cherry-red drip over smooth buttercream. Striking, sweet, and ready for celebrations of any size.",
    "Bueno Drip Cake": "A luxe drip finish with chocolatey styling that’s perfect for weekend treats and big birthdays.",
    "Vanilla Celebration — 6-inch": "A classic vanilla cake sized for intimate gatherings. Simple, elegant, and easy to customise with a message.",
    "Vanilla Celebration — 8-inch": "Our most versatile celebration cake—balanced size for families, office treats, and dinner parties.",
    "Vanilla Celebration — 10-inch": "Generously sized for larger groups, with a smooth finish ready for candles and toppers.",
    "Cupcakes — 6 Pack": "Six soft cupcakes topped with swirls of buttercream. Great for gifts, staff perks, or dessert platters.",
    "Cupcakes — 12 Pack": "A full dozen party-ready cupcakes—easy to share and perfect for office birthdays or class events.",
    "Cupcakes — 18 Pack": "Plenty to go around! Ideal for bigger birthdays, teams, and community meet-ups.",
    "Hello Kitty Cake": "A sweet, themed cake for fans of all ages. Bright, cheerful styling for unforgettable photos.",
    "Car Cake": "A motorsport-inspired celebration cake that’s a natural fit for car lovers and milestone birthdays.",
    "Butterfly Cake": "Delicate, colourful accents and a smooth finish—made for spring and garden-party vibes.",
    "Girl Christening Cake": "A refined, elegant design suited to christenings, naming days, and family gatherings.",
    "Spongebob Cake": "Bright, character-forward fun that brings smiles to the table—great for themed birthdays.",
    "Among Us Cake": "A playful, gaming-inspired cake for fans and party squads. Instant hit with kids and teens.",
    "Baby Girl Cake": "Soft colours and a gentle design perfect for baby showers and first birthdays.",
    "Spider Man Cake": "A comic-book favourite in cake form—big colours and big excitement for superhero parties.",
    "Gender Reveal Cake 2": "A tidy, modern reveal cake ready to share your news in style—perfect for small or large gatherings.",
    "Girl Bear Cake": "Adorable bear motif with a clean, sweet finish—ideal for young birthdays and baby celebrations.",
    "Baby Boy Cake": "A classic, softly styled cake that suits naming days, showers, and first birthdays.",
    "Minnie Mouse Cake": "A timeless favourite with playful detailing for magical birthdays.",
    "Gender Reveal Cake 1": "Simple, elegant styling built for that special reveal moment with friends and family.",
    "Oreo Drip Cake": "Cookies-and-cream energy with a bold drip finish. A chocolate lover’s dream.",
    "Rainbow Drip Cake": "Layers of colour and a joyful drip—perfect for milestone birthdays and pride celebrations.",
    "Merry Christmas Cake": "Seasonal styling and a celebration finish made for winter gatherings and gifting.",
    "Baby Boy Cake 2": "Fresh, modern take on a baby-themed cake. Clean lines, ready for your custom topper.",
    "Chocolate Lovers Drip Cake": "Rich chocolate look with a glossy drip for instant wow factor.",
    "Love Cupcake": "A romantic single-theme cupcake with a generous buttercream swirl—a sweet gift or party favour.",
    "Mix It Up": "A fun, colourful celebration cake with playful styling. Great for kids’ parties and casual get-togethers.",
    "Ocean Birthday Cake": "Sea-inspired colours and textures bring a splash of fun to your celebration.",
    "Choco Swirl Cupcake": "A soft cupcake crowned with a tall chocolate-swirl buttercream. Perfect with coffee or as a mini treat box.",
    "Novelty Christmas Cake": "Whimsical holiday design that looks great on any festive table.",
    "Rainbow Layer Cake": "A vibrant, multicolour layer cake that slices beautifully—made for big smiles and big moments.",
    "Rose Top Cupcake": "A pretty buttercream rose swirl on a delicate cupcake—ideal for gifts and afternoon tea.",
    "Colour Number Foil Balloon": "Bold, shiny number balloon that sets the tone for milestone birthdays and anniversaries.",
    "Happy Birthday Candles": "Classic “Happy Birthday” candles for a quick, photo-ready finishing touch.",
    "Pink Candles": "Soft pink candles to complement pastels, florals, and baby-themed designs.",
    "Balloons": "A bright bunch that instantly dresses your party table. Great add-on for collections and bundles.",
    "Sparkler Candles": "Add sparkle to the big moment with indoor-use sparkler sticks (adult supervision recommended).",
    "Silver Foil Balloon": "A sleek metallic balloon that pairs well with modern cakes and monochrome themes.",
    "Number Birthday Candles": "Mix-and-match numerals to mark the perfect age or anniversary on any cake."
}